FI/Esitiedot/AddEsitieto_Example_xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:tiet="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:tiet1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Esitiedot.Contracts.DataContracts">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:Esitiedot_Sisaan_Request>
         <!--Optional:-->
         <tem:MessageHeader>
            <!--Optional:-->
            <!--type: string-->
            <tiet:MessageID>gero et</tiet:MessageID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:TransactionID>sonoras imperio</tiet:TransactionID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:SenderID>quae divum incedo</tiet:SenderID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:SenderApplication>verrantque per auras</tiet:SenderApplication>
            <!--type: string-->
            <tiet:ReceiverID>per auras</tiet:ReceiverID>
            <!--Optional:-->
            <!--type: string-->
            <tiet:ReceiverApplication>circum claustra</tiet:ReceiverApplication>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CharacterSet>nimborum in</tiet:CharacterSet>
            <!--Optional:-->
            <!--type: string-->
            <tiet:DataServiceURL>foedere certo</tiet:DataServiceURL>
            <!--Optional:-->
            <!--type: string-->
            <tiet:UserLanguageCode>profundum quippe ferant</tiet:UserLanguageCode>
            <!--Optional:-->
            <!--type: string-->
            <tiet:VersionNumber>et carcere</tiet:VersionNumber>
         </tem:MessageHeader>
         <!--Optional:-->
         <tem:Common>
            <!--Optional:-->
            <!--type: string-->
            <tiet:ContractKey>h4C55Ato!</tiet:ContractKey>
            <!--Optional:-->
            <!--type: string-->
            <tiet:UserId>speluncis abdidit</tiet:UserId>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CallingSystem>HackathonAdmin</tiet:CallingSystem>
            <!--Optional:-->
            <!--type: string-->
            <tiet:CallingUserId>flammas turbine</tiet:CallingUserId>
         </tem:Common>
         <!--Optional:-->
               <tem:Contact>
            <tiet1:PatientId>
               <tiet1:Identifier>123432-1234</tiet1:Identifier>
            </tiet1:PatientId>
            <tiet1:Created>2013-05-05</tiet1:Created>
            <tiet1:Finished>2014-05-04</tiet1:Finished>
            <tiet1:FormsetCode>E121</tiet1:FormsetCode>
            <tiet1:FormsetCodesystem>1.123.234.567</tiet1:FormsetCodesystem>
            <tiet1:FormsetName>Testaajan testikysely</tiet1:FormsetName>
            <tiet1:Organisation>Kalvolan TK</tiet1:Organisation>
            <!--Optional:-->
            <tiet1:OrganisationOid>1.2.246.10.19623654.19.1</tiet1:OrganisationOid>
            <!--Optional:-->
            <tiet1:OrgUnit>Kehvon Anamneesitutkimuskeskus</tiet1:OrgUnit>
            <!--Optional:-->
            <tiet1:OrgUnitOid>121.121.121.234.0</tiet1:OrgUnitOid>
            <!--Optional:-->
            <tiet1:Severity>1</tiet1:Severity>
            <!--Optional:-->
            <!--type: Status - enumeration: [FORMSET_SENT,FORMSET_RECEIVED,DATA_AS_IMAGE]-->
            <tiet1:Status>FORMSET_RECEIVED</tiet1:Status>
            <tiet1:Originator>3´rd party name</tiet1:Originator>
         </tem:Contact>
         <!--Optional:-->
         <tem:ContactMetadata>
            <!--Zero or more repetitions:-->
            <tiet1:ContactMetadata>
               <tiet1:Key>AR12312</tiet1:Key>
               <tiet1:Value>image.jpg</tiet1:Value>
            </tiet1:ContactMetadata>
         </tem:ContactMetadata>
         <!--Optional:-->
       <!--Optional:-->
         <tem:Forms>
            <!--Zero or more repetitions:-->
            <tiet1:Form>
               <tiet1:FormCode>A3399T</tiet1:FormCode>
               <tiet1:FormCodeSystem>123.123.123.444</tiet1:FormCodeSystem>
               <tiet1:FormName>Testform</tiet1:FormName>
               <!--Optional:-->
               <tiet1:Order>1</tiet1:Order>
               <!--Optional:-->
               <tiet1:Severity>1</tiet1:Severity>
               <tiet1:Questions>
                  <!--Zero or more repetitions:-->
                  <tiet1:Question>
                     <tiet1:QuestionCode>1</tiet1:QuestionCode>
                     <tiet1:QuestionCodeSystem>123.456.789.10</tiet1:QuestionCodeSystem>
                     <tiet1:QuestionText>Kysymys yksi</tiet1:QuestionText>
                     <!--Optional:-->
                     <tiet1:Order>1</tiet1:Order>
                     <!--Optional:-->
                     <tiet1:Language>fi</tiet1:Language>
                     <!--Optional:-->
                     <tiet1:Severity>1</tiet1:Severity>
                     <!--Optional:-->
                    
                     <!--Optional:-->
                     <tiet1:Answer>
                        <!--Optional:-->
                        <tiet1:AnswerCode>1</tiet1:AnswerCode>
                        <!--Optional:-->
                        <tiet1:AnswerCodeSystem>123.456.123.10</tiet1:AnswerCodeSystem>
                        <tiet1:AnswerText>Vastaus kysymykseen yksi</tiet1:AnswerText>
                     </tiet1:Answer>
                  </tiet1:Question>
  		  <!--Zero or more repetitions:-->
                  <tiet1:Question>
                     <tiet1:QuestionCode>2</tiet1:QuestionCode>
                     <tiet1:QuestionCodeSystem>123.456.789.10</tiet1:QuestionCodeSystem>
                     <tiet1:QuestionText>Kysymys kaksi</tiet1:QuestionText>
                     <!--Optional:-->
                     <tiet1:Order>1</tiet1:Order>
                     <!--Optional:-->
                     <tiet1:Language>fi</tiet1:Language>
                     <!--Optional:-->
                     <tiet1:Severity>1</tiet1:Severity>
                     <!--Optional:-->
                     <tiet1:ParentQuestion>1</tiet1:ParentQuestion>
                     <!--Optional:-->
                     <tiet1:Answer>
                        <!--Optional:-->
                        <tiet1:AnswerCode>2</tiet1:AnswerCode>
                        <!--Optional:-->
                        <tiet1:AnswerCodeSystem>123.123.123</tiet1:AnswerCodeSystem>
                        <tiet1:AnswerText>Vastaus kysymykseen kaksi joka liittyy parentquestion-arvon kautta kysymykseen yksi</tiet1:AnswerText>
                     </tiet1:Answer>
                  </tiet1:Question>
		  <tiet1:Question>
                     <tiet1:QuestionCode>3</tiet1:QuestionCode>
                     <tiet1:QuestionCodeSystem>123.456.789.10</tiet1:QuestionCodeSystem>
                     <tiet1:QuestionText>Kysymys kolme, jolle ei ole annettu vastausta. Answer osuus puuttuu.</tiet1:QuestionText>
                     <!--Optional:-->
                     <tiet1:Order>3</tiet1:Order>
                     <!--Optional:-->
                     <tiet1:Language>fi</tiet1:Language>
                     <!--Optional:-->
                     <tiet1:Severity>2</tiet1:Severity>
                     <!--Optional:-->
                     
                     <!--Optional:-->
                     
                  </tiet1:Question>
               </tiet1:Questions>
            </tiet1:Form>
         </tem:Forms>
      </tem:Esitiedot_Sisaan_Request>
   </soapenv:Body>
</soapenv:Envelope>
